app/controllers/account_verify_controller.rb

  def index
    @login = params[:id]
	@email = User.find_by_login(@login).email
---
SELECT * FROM `users` WHERE (`users`.`login` = 'amit1232211131') LIMIT 1