app/controllers/expert_companies_controller.rb

SELECT * FROM `expert_companies` WHERE (`expert_companies`.`user_id` = 2) LIMIT 1
---
  def index

	@expert_company = ExpertCompany.find_by_user_id(self.current_user.id)

SELECT * FROM `expert_companies` WHERE (`expert_companies`.`id` = 1)
---
  def show
    @expert_company = ExpertCompany.find(params[:id])

SELECT * FROM `expert_companies` WHERE (`expert_companies`.`id` = 1)
---
  def edit
    @expert_company = ExpertCompany.find(params[:id])

INSERT INTO `expert_companies` (`business`, `hearaboutus`, `companyname`, `updated_at`, `noemplyees`, `country`, `user_id`, `jobtitle`, `created_at`) VALUES('Website Design / Website Marketing', 'Internet', 'tushar', '2009-06-11 14:45:03', '1 - 10', 'Albania', NULL, 'tushar', '2009-06-11 14:45:03')
---
  def create
    @expert_company = ExpertCompany.new(params[:expert_company])
	@expert_company.user_id = self.current_user.id
    #respond_to do |format|
      if @expert_company.save

SELECT * FROM `expert_companies` WHERE (`expert_companies`.`id` = 1)
---
  def update
    @expert_company = ExpertCompany.find(params[:id])