app/controllers/expert_professionals_controller.rb

SELECT * FROM `expert_professionals`
---
  def index
    @expert_professionals = ExpertProfessional.all