app/controllers/expert_locations_controller.rb

  def index
    @expert_locations = ExpertLocation.find_by_user_id(self.current_user.id)
---
SELECT * FROM `expert_locations` WHERE (`expert_locations`.`user_id` = 2) LIMIT 1

  def show
    @expert_location = ExpertLocation.find(params[:id])
---
SELECT * FROM `expert_locations` WHERE (`expert_locations`.`id` = 1)

  def edit
    @expert_location = ExpertLocation.find(params[:id])
---
SELECT * FROM `expert_locations` WHERE (`expert_locations`.`id` = 2)

  def create
    @expert_location = ExpertLocation.new(params[:expert_location])
	@expert_location.user_id = self.current_user.id
    respond_to do |format|
      if @expert_location.save
---
INSERT INTO `expert_locations` (`city`, `updated_at`, `addressline1`, `addressline2`, `country`, `postalcode`, `phone`, `user_id`, `created_at`) VALUES('amravati', '2009-06-11 03:51:37', 'amar colony', 'by pass road', 'india', 444606, '9960401428', 2, '2009-06-11 03:51:37')

  def update
    @expert_location = ExpertLocation.find(params[:id])
---
SELECT * FROM `expert_locations` WHERE (`expert_locations`.`id` = 1)