app/controllers/expert_personals_controller.rb

  def index
    @expert_personal = ExpertPersonal.find_by_user_id(self.current_user.id)
---
SELECT * FROM `expert_personals` WHERE (`expert_personals`.`user_id` = 2) LIMIT 1

  def show
    @expert_personal = ExpertPersonal.find(params[:id])
---
SELECT * FROM `expert_personals` WHERE (`expert_personals`.`id` = 1)

  def edit
    @expert_personal = ExpertPersonal.find(params[:id])
---
SELECT * FROM `expert_personals` WHERE (`expert_personals`.`id` = 1)

  def create
    @expert_personal = ExpertPersonal.new(params[:expert_personal])
	@expert_personal.user_id = self.current_user.id
    respond_to do |format|
      if @expert_personal.save
---
INSERT INTO `expert_personals` (`security`, `city`, `answer`, `phoneareacode`, `updated_at`, `addressline1`, `addressline2`, `timezone`, `phonecountrycode`, `country`, `firstname`, `lastname`, `phonenumber`, `postalcode`, `user_id`, `picture`, `created_at`) VALUES('What is your primary frequent flyer number', 'Alaska', '123', 721, '2009-06-11 13:46:22', 'i dowent know', 'sas', 'GMT + 00:00', 91, 'Albania', 'Tushar', 'Dongare', 9960401428, 44606, 2, x'57617465725f6c696c6965732e6a7067', '2009-06-11 13:46:22')

  def update
    @expert_personal = ExpertPersonal.find(params[:id])

    #respond_to do |format|
      if @expert_personal.update_attributes(params[:expert_personal])
---
SELECT * FROM `expert_personals` WHERE (`expert_personals`.`id` = 1)
UPDATE `expert_personals` SET `answer` = '12333', `updated_at` = '2009-06-11 14:26:57' WHERE `id` = 1