app/controllers/provider_locations_controller.rb

  def index
    @provider_locations = ProviderLocation.all
---
SELECT * FROM `provider_locations`

  def show
    @provider_location = ProviderLocation.find(params[:id])
---
SELECT * FROM `provider_locations` WHERE (`provider_locations`.`id` = 1)

  def edit
    @provider_location = ProviderLocation.find(params[:id])
---
SELECT * FROM `provider_locations` WHERE (`provider_locations`.`id` = 2)

  def create
    @provider_location = ProviderLocation.new(params[:provider_location])
	@provider_location.user_id = self.current_user.id
    respond_to do |format|
      if @provider_location.save
---
INSERT INTO `provider_locations` (`city`, `addressline1`, `addressline2`, `country`, `postalcode`, `phone`, `user_id`) VALUES('Amravati', 'by pass road', NULL, 'India', 444606, '9960401428', NULL)

  def destroy
    @provider_location = ProviderLocation.find(params[:id])
    @provider_location.destroy
---
SELECT * FROM `provider_locations` WHERE (`provider_locations`.`id` = 3)
DELETE FROM `provider_locations` WHERE `id` = 3