app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
	@roles = Role.find_all_by_name(params[:role])
	@user.roles << @roles
---
SELECT * FROM `roles` WHERE (`roles`.`name` = 'client')
INSERT INTO `users` (`name`, `salt`, `updated_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `activation_code`, `remember_token`, `login`, `email`, `created_at`) VALUES('', '8735c9d175ef92d0c9d3b294c5860771846d2add', '2009-06-09 07:40:51', NULL, '18f382f560caaefe0803af5cee979f0fb5f40642', NULL, 'f80ce1b59ecd50c405cfc776b67a65f0145b7511', NULL, 'tushar', 'tushar.dongare@pragtech.co.in', '2009-06-09 07:40:51')